namespace Hyper.Domain.Entities.Promotions.Enums;

/// <summary>
/// دسته‌بندی پویش بر اساس محتوا/موضوع
/// این enum فقط برای دسته‌بندی و گزارش‌گیری استفاده می‌شود و نباید در منطق بیزینس استفاده شود
/// </summary>
public enum PromotionCategory : int
{
	/// <summary>
	/// سیستم پاداش برای خریدها و فعالیت‌های مختلف.
	/// این دسته برای قوانین امتیازدهی (Scoring Rules) استفاده می‌شود.
	/// </summary>
	[Description("برنامه‌های پاداش و امتیازی")]
	RewardsAndPointsPrograms = 1,
	
    /// <summary>
	/// پویش‌های مرتبط با رویدادهای عمومی (ملی و مذهبی)
	/// مثال: روز استقلال، روز ملی، عید فطر، عید قربان، محرم، رمضان
	/// </summary>
	[Description("رویدادهای عمومی")]
    PublicEvents = 2,

    /// <summary>
    /// پویش‌های مرتبط با رویدادهای شخصی مشتری
    /// شامل: سالروز نصب اپلیکیشن، سالروز افتتاح حساب، سالروز عضویت در جامعه، روز تولد
    /// </summary>
    [Description("رویدادهای شخصی")]
    PersonalEvents = 3,

    /// <summary>
    /// پویش‌های پیشنهاد انحصاری برای اعضای باشگاه
    /// شامل: تخفیف‌های انحصاری، پیشنهادهای ویژه، دسترسی زودهنگام، پیش‌فروش
    /// </summary>
    [Description("پیشنهادهای انحصاری")]
    ExclusiveOffers = 4,

    /// <summary>
    /// پویش‌های تعاملی و هدیه‌ای
    /// شامل: هدایای رایگان، کوپن هدیه، مسابقات، چالش‌های تعاملی
    /// </summary>
    [Description("پویش‌های تعاملی")]
    InteractivePromotions = 5,
}
